In [65]:
import pandas as pd

In [66]:
df = pd.read_csv("students.csv")
print(df)

             Name   Age  Gender        City                Course  Score
0   Aabid Khokhar  24.0    Male     Karachi    Applied Psychology   95.0
1        Areesha   23.0  Female     Karachi    Applied Psychology   99.0
2      Afroz Khan  21.0    Male         NaN  Communication Skills   75.0
3          Bilal   22.0    Male      Lahore  Computer Programming   55.0
4        Shahweed  20.0     NaN      Lahore       Web Development   83.0
5       Abu Nasar   NaN    Male      Quetta        Linear Algebra    NaN
6            Sara  23.0  Female   Faislabad            Psychology   78.0
7           Hafsa  24.0  Female     Larkana       Applied Physics   81.0
8            Neha  19.0  Female  Mirpurkhas  Communication Skills   90.0
9           Yumna  21.0     NaN     Karachi  Computer Programming   62.0
10      Ahad Raza  18.0    Male   Islamabad                   NaN   74.0
11  Aamir Khokhar  29.0    Male  Mirpurkhas        Linear Algebra   94.0
12         Layba   17.0  Female     Karachi            Psychology   92.0

### .cloumns: Get all columns name

In [67]:
print(df.columns)
print(list(df.columns))

Index(['Name', 'Age', 'Gender', 'City', 'Course', 'Score'], dtype='object')
['Name', 'Age', 'Gender', 'City', 'Course', 'Score']

- Get Selected columns

In [68]:
# Get selected columns
print(df[["Name", "Gender", "Course"]].head())

            Name  Gender                Course
0  Aabid Khokhar    Male    Applied Psychology
1       Areesha   Female    Applied Psychology
2     Afroz Khan    Male  Communication Skills
3         Bilal     Male  Computer Programming
4       Shahweed     NaN       Web Development

### head : Get first 5 rows

In [69]:
print(df.head())

            Name   Age  Gender     City                Course  Score
0  Aabid Khokhar  24.0    Male  Karachi    Applied Psychology   95.0
1       Areesha   23.0  Female  Karachi    Applied Psychology   99.0
2     Afroz Khan  21.0    Male      NaN  Communication Skills   75.0
3         Bilal   22.0    Male   Lahore  Computer Programming   55.0
4       Shahweed  20.0     NaN   Lahore       Web Development   83.0

### Tail : Get last 5 rows

In [70]:
print(df.tail())

             Name   Age  Gender        City                Course  Score
8            Neha  19.0  Female  Mirpurkhas  Communication Skills   90.0
9           Yumna  21.0     NaN     Karachi  Computer Programming   62.0
10      Ahad Raza  18.0    Male   Islamabad                   NaN   74.0
11  Aamir Khokhar  29.0    Male  Mirpurkhas        Linear Algebra   94.0
12         Layba   17.0  Female     Karachi            Psychology   92.0

### Data Type

In [71]:
print(df.dtypes)

Name       object
Age       float64
Gender     object
City       object
Course     object
Score     float64
dtype: object

### Describe : count, min, max, mean, 25%, 50%, 75%

In [75]:
print(df.describe())

             Age      Score
count  12.000000  12.000000
mean   21.750000  81.500000
std     3.222788  13.561309
min    17.000000  55.000000
25%    19.750000  74.750000
50%    21.500000  82.000000
75%    23.250000  92.500000
max    29.000000  99.000000

### Filter

In [76]:
filtered = df[df["Score"] > 80]
print(filtered)

             Name   Age  Gender        City                Course  Score
0   Aabid Khokhar  24.0    Male     Karachi    Applied Psychology   95.0
1        Areesha   23.0  Female     Karachi    Applied Psychology   99.0
4        Shahweed  20.0     NaN      Lahore       Web Development   83.0
7           Hafsa  24.0  Female     Larkana       Applied Physics   81.0
8            Neha  19.0  Female  Mirpurkhas  Communication Skills   90.0
11  Aamir Khokhar  29.0    Male  Mirpurkhas        Linear Algebra   94.0
12         Layba   17.0  Female     Karachi            Psychology   92.0

### Null: Getting no of nulls from each column

In [ ]:
print(df.isnull().sum())

Name      0
Age       1
Gender    2
City      1
Course    1
Score     1
dtype: int64

In [81]:
df1 = df.fillna("None")
print(df1)

             Name   Age  Gender        City                Course Score
0   Aabid Khokhar  24.0    Male     Karachi    Applied Psychology  95.0
1        Areesha   23.0  Female     Karachi    Applied Psychology  99.0
2      Afroz Khan  21.0    Male        None  Communication Skills  75.0
3          Bilal   22.0    Male      Lahore  Computer Programming  55.0
4        Shahweed  20.0    None      Lahore       Web Development  83.0
5       Abu Nasar  None    Male      Quetta        Linear Algebra  None
6            Sara  23.0  Female   Faislabad            Psychology  78.0
7           Hafsa  24.0  Female     Larkana       Applied Physics  81.0
8            Neha  19.0  Female  Mirpurkhas  Communication Skills  90.0
9           Yumna  21.0    None     Karachi  Computer Programming  62.0
10      Ahad Raza  18.0    Male   Islamabad                  None  74.0
11  Aamir Khokhar  29.0    Male  Mirpurkhas        Linear Algebra  94.0
12         Layba   17.0  Female     Karachi            Psychology  92.0